{
	"_id": {"$oid":"5ef097c0ee4f5d8b7df5cb55"},
	"UI":"10",
	"functionality":"10",
	"comments":"Website works great, it would be really cool if you could easily export the 	graphs as either a pdf, or just a simple copy and paste as this would really help when trying to present the graph in presentations or coursework.",
	"user":{"$oid":"5ef096ebee4f5d8b7df5cb54"}
}

{
  "_id":{"$oid":"5ef0922bee4f5d8b7df5cb53"},
	"UI":"7",
	"functionality":"9",
	"comments":"For user interface, the bar graph and the selections to the left did not fit the screen of my iPad correctly. There was also some of the buttons that were not uniform when viewing the website on my iPad.  Otherwise everything else was really good and intuitive I feel. \r\n\r\nIn addition, I would may make it so that when you have a survey open you can edit the name up top rather than from only the dashboard.\r\n\r\nMore tests and types of graphs would be interesting as well. However, I was very impressed with how the website guided me with the variables in both graph making and analysis. \r\n",
	"user":{"$oid":"5ef08f6903b31735ab7ec23e"}
}

{
	"_id":{"$oid":"5ef09ce803b31735ab7ec240"},
	"UI":"5",
	"functionality":"5",
	"comments":"Website is really clean at the moment, obviously there will be more feautures that will be added but for the time being it looks good\r\npotential idea is to have users be able to enter survey data in browser?\r\nWasn't sure how to get back to and view my spreadsheets, might be better to call dashboard home?\r\nGoing from the main page into analyse data isn't working\r\n\r\n\r\n\r\nGave the project 5/5 because whilst the website is functional I think there is still some work to be done to increase the number of features as well as make the layout potentially a bit more eyecatching without over doing it. Is definitely a very strong VIP.",
	"user":{"$oid":"5ef09a36ee4f5d8b7df5cb56"}
}


{
	"_id":{"$oid":"5ef0ebb5d95f76f5f8ee2276"},
	"UI":"7",
	"functionality":"7",
	"comments":"The interface is fast and responsive. Generating graphs and running statistical tests feels nice and quick.\r\n\r\nHere is some additional feedback and some items you may consider for future versions. Feel free to use/ignore any, just some ideas!:\r\n- The \"Dashboard\" might benefit from being \"dataset-centric\". I.e. when I choose a dataset the dashboard sections (graphs / stats tests) relevant to that dataset could be listed.\r\n- Following on from above, it would be interesting if quick previews of the charts could be displayed (i.e. as cards rather than as a list of charts). Also, previews of stats tests could be interesting (for example, to highlight those that are statistically significant).\r\n- The system could benefit from additional statistical tests and chart types (e.g. scatter charts, line charts, etc.).\r\n- Could the system detect more complex data types? For example, for comparing a numeric value against a coordinate system (e.g. for displaying maps or heatmaps using Leaflet JS) or time series.\r\n- As a non-statitician (but a researcher) it would be useful if the system could do some of the heavy lifting for me. For example, when I create a dataset it could iterate through a number of statistical tests itself in order to automatically find combinations of attributes/tests that generate a significant P-value. This could then be presented on the screen, or pushed via web push protocols or sent via the email address I registered with.\r\n- Similarly, once there are further chart types available, when I choose the data I would like to compare it would be useful for the system to recommend chart types to me (e.g. if numeric/numeric it could suggest scatter plots, if numeric/datetime it could suggest a line chart, and so on).\r\n- Can the charts be exportable or downloadable as an image to be embedded straight into presentations or papers?\r\n- If a dataset has missing values in some columns/rows, could you make use of simple machine learning (e.g. a regression model) to \"predict\" what the missing values should be?\r\n- Can the system be configured to download datasets directly from a URL rather than uploaded from my computer?",
	"user":{"$oid":"5ef0d92b88c3a5388b51c7ac"}
}


{
	"_id":{"$oid":"5ef3006cd95f76f5f8ee2279"},
	"UI":"5",
	"functionality":"6",
	"comments":"Really good functionality, looks like there are a lot of features. Would be good to have some of the statistical tests explained. Found myself wanting some explanations though and some guidance on how to use the site. Perhaps it could feature a 'Demo' mode for new users that you see on some sites that darkens areas of the screen and guides you through usage with tooltips on first use.",
	"user":{"$oid":"5ef2ff0d550e63b3b5e54a83"}
}


{
	"_id":{"$oid":"5ef4575888c3a5388b51c7b3"},
	"UI":"10",
	"functionality":"10",
	"comments":"I'm getting an error message for bar chart creation but the quick stats were really good!",
	"user":{"$oid":"5ef454dd88c3a5388b51c7b1"}
}
