{
	"_id":{"$oid":"5f0c25ae0e0a0dff5d8613cc"},
	"UI_2":"9",
	"functionality_2":"9",
	"comments_2":"The system couldn't handle a bigger file when I tried to give it that, but other than that it looks very good. One thing is that on the password reset the fields when entering a new password are both set to email. I suppose the next steps are adding more tests where you can ",
	"user":{"$oid":"5ef09a36ee4f5d8b7df5cb56"}
}

{
	"_id":{"$oid":"5f0c3862afd0c9bc2f6ad4dd"},
	"UI_2":"9",
	"functionality_2":"8",
	"comments_2":"Histograms and box and whisker plots may be beneficial as they are graphs that can give a form of analysis based on their ‘appearance’. ",
	"user":{"$oid":"5f09e1b476f1bc999917888e"}
}


{
	"_id":{"$oid":"5f0f1f9630d28b2877e4fffa"},
	"UI_2":"10",
	"functionality_2":"9",
	"comments_2":"Love the feel of the website, very smooth animations and transitions, what you can do with the data is very useful. Tried to break it with a large dataset and it handled it well with statistical tests, the graph page froze though but the dataset had 11000 rows so I wouldn't worry about it.\r\nWould be cool if in the statistical test page you could hover over the headings and it could describe what they mean (e.g. significance, p value)? \r\nAnd when selecting the x and y values on the graph page, my data didn't have row headers so I was selecting based on the first value in each column - maybe be able to select based on Column no.?\r\nWebsite is amazing though I'm really trying to find things to criticise, good job",
	"user":{"$oid":"5f0eeda8afd0c9bc2f6ad4df"}
}

{
	"_id":{"$oid":"5f0f2b84afd0c9bc2f6ad4ed"},
	"UI_2":"8",
	"functionality_2":"7",
	"comments_2":"User interface is looking very good. I like the feature allowing all tests/graphs to be saved to the dashboard or exported. Perhaps you could explore exporting some different formats in order to import in to statistical packages. \r\n\r\nWould be good to have some descriptions to explain each statistical test",
	"user":{"$oid":"5ef2ff0d550e63b3b5e54a83"}
}
